Repository: nakshatra-nahar/RustTimeTrack
Catalog: po/*.po
Languages: de, es, it

source: Track your time without being tracked
de: Erfassen Sie Ihre Zeit ohne getrackt zu werden
es: Controle su tiempo sin ser controlado
it: Traccia il tuo tempo senza essere tracciato

source: rusttimetrack is a time tracking app built for GNOME with Rust and GTK4. In addition to tracking time spent on tasks, you can edit that time, delete entries, and change settings. It even has idle detection.
de: rusttimetrack ist eine Zeiterfassungsanwendung, die für Gnome mit Rust und GTK4 entwickelt wurde. Zusätzlich zur Erfassung der für Aufgaben aufgewendeten Zeit können Sie diese Zeit bearbeiten, Einträge löschen und Einstellungen ändern. Es hat sogar eine Inaktivitätserkennung.
it: rusttimetrack è un'applicazione per tenere traccia del tempo scritta in Rust e GTK4 per GNOME. Oltre a registrare il tempo speso compiendo le attività, permette di modificare manualmente il tempo, eliminare precedenti registrazioni e cambiare impostazioni. È anche in grado di rilevare l'inattività.

source: Autocompletion
de: Autovervollständigung

source: Bug fixes
de: Fehlerbehebungen
it: Correzione di bug

source: Translation improvements
de: Verbesserte Übersetzung

source: 1.8 is a big update for rusttimetrack!
de: 1.8 ist ein großes Update für rusttimetrack!

source: Add 'This week' and 'Last week' to Reports
de: "Diese Woche" und "Letzte Woche" zu Berichten hinzugefügt

source: Setting to update today's total time as timer ticks
de: Einstellung zur Aktualisierung der Gesamtzeit des heutigen Tages, wenn der Timer tickt

source: Bug fix: Pomodoro no longer displays one minute off
de: Fehlerbehebung: Pomodoro wird nicht mehr eine Minute abweichend angezeigt

source: Exported CSV now includes total seconds
de: Exportierte CSV-Datei enthält jetzt die Gesamtsekunden

source: Moved 'total time' across from the date
de: "Gesamtzeit" gegenüber dem Datum verschoben

source: Preferences is now split into sections
de: Einstellungen sind jetzt in mehrere Abschnitte unterteilt

source: Updated to Gnome 44 runtime
de: Auf Gnome 44-Laufzeitumgebung aktualisiert

source: Now uses libadwaita AboutWindow
de: Verwendet jetzt das Libadwaita AboutWindow

source: Manually add new task to group
de: Manuelles Hinzufügen einer neuen Aufgabe zur Gruppe

source: Updated translations
de: Aktualisierte Übersetzungen

source: The location of the database is now changeable
de: Der Speicherort der Datenbank kann jetzt verändert werden
it: È ora possibile cambiare la posizione del database

source: Backup database
de: Datenbank sichern
it: Backup del database

source: Import databases
de: Datenbanken importieren
it: Importazione di database

source: Bug fixes and improvements
de: Fehlerbehebungen und Verbesserungen
it: Correzioni di bug e miglioramenti

source: New icon!
de: Neues Symbol!
it: Nuova icona!

source: Dates are now ISO 8601 format
de: Daten sind jetzt im ISO-8601-Format
it: Le date sono ora nel formato ISO 8601

source: Added a button to restart tasks
de: Knopf zum Neustarten von Aufgaben hinzugefügt
it: Aggiunto un pulsante per far ripartire le attività

source: Timer centered on empty state
de: Timer bei leerem Zustand zentriert
it: Il timer è stato spostato al centro della zona vuota

source: Uses local date format
de: Nutzt das lokale Datumsformat
it: Formato data localizzato

source: Generate reports of task history over a specified timeframe
de: Generieren Sie Berichte über den Aufgabenverlauf über einen bestimmten Zeitraum
it: Genera resoconti delle attività svolte in un determinato periodo

source: Ability to add tasks manually
de: Möglichkeit, Aufgaben manuell hinzuzufügen
it: È possibile aggiungere attività manualmente

source: Auto-save option
de: Option zum automatischen Speichern
it: Opzione di salvataggio automatico

source: Task names can now be changed for an entire group
de: Aufgabennamen können jetzt für eine gesamte Gruppe geändert werden
it: Il nome delle attività può essere cambiato per un intero gruppo

source: Added Pomodoro-style countdown timer!
de: Pomodoro-Timer hinzugefügt!
it: Aggiunto conto alla rovescia in stile Pomodoro!

source: Ability to add tags!
de: Möglichkeit, Tags hinzuzufügen!
it: Aggiunti i tag

source: Fixed icon positioning
de: Symbolpositionierung korrigiert
it: La posizione dell'icona è stata corretta

source: Changed start button color and behavior
de: Veränderte Farbe und Verhalten des Start-Knopfes
it: Il colore e il funzionamento del pulsante avvia sono stati modificati

source: Changed color of delete buttons
de: Veränderte Farbe der Löschen-Knöpfe
it: Il colore del pulsante elimina è stato cambiato

source: Dutch, Brazilian Portuguese, and French translations
de: Übersetzungen ins Niederländische, Brasilianische, Portugiesische und Französische
it: Traduzioni olandese, brasiliana e francese

source: rusttimetrack has a new icon! And lots of bug fixes and improvements.
de: rusttimetrack hat ein neues Symbol! Und viele Fehlerbehebungen und Verbesserungen.
it: rusttimetrack ha una nuova icona! Oltre a diversi miglioramenti e correzioni di bug.

source: First stable release of rusttimetrack.
de: Erste stabile Veröffentlichung von rusttimetrack.
es: Primera versión estable de rusttimetrack.
it: La prima versione stabile di rusttimetrack.

source: Track time spent on tasks
de: Für Aufgaben aufgewendete Zeit erfassen
es: Controlar el tiempo dedicado a las tareas
it: Traccia il tempo speso compiendo delle attività

source: Change/delete recorded times
de: Erfasste Zeiten ändern/löschen
es: Modificar/borrar los tiempos registrados
it: Cambia/elimina i tempi registrati

source: Idle detection
de: Inaktivitätserkennung
es: Detección de inactividad
it: Rilevamento di inattività

source: Export as CSV
de: Als CSV exportieren
it: Esporta come CSV

source: Cancel
de: Abbrechen
es: Cancelar
it: Annulla

source: Export
de: Exportieren
it: Esporta

source: - no file selected -
de: - Keine Datei ausgewählt -
it: - nessun file selezionato -

source: CSV export preferences
de: CSV-Exporteinstellungen
it: Preferenze esportazione come CSV

source: Sort by
de: Sortieren nach
it: Ordina per

source: Start time
de: Startzeit
it: Inizio

source: Stop time
de: Stoppzeit
it: Fine

source: Task name
de: Aufgabenname
it: Nome attività

source: Sort order
de: Sortierreihenfolge
it: Ordine

source: Ascending
de: Aufsteigend
it: Ascendente

source: Descending
de: Absteigend
it: Discendente

source: General
de: Allgemein
it: Generali

source: Appearance
de: Erscheinungsbild
es: Apariencia
it: Aspetto

source: _Dark theme
de: _Dunkles Thema
es: _Tema oscuro
it: Tema scuro

source: Idle
de: Inaktivität
es: Inactivo
it: Inattività

source: Notify of idle
de: Inaktivität melden
es: Notificación de inactividad
it: Notifiche inattività

source: (GNOME only)
de: (Nur GNOME)
it: (Solo per GNOME)

source: _Minutes to idle
de: _Minuten bis zur Inaktivität
es: _Minutos de inactividad
it: Minuti per l'inattività

source: Number of minutes before the user is considered idle
de: Anzahl der Minuten, bevor der Benutzer als inaktiv betrachtet wird
es: Número de minutos antes de que el usuario se considere inactivo
it: Il numero di minuti prima che l'utente sia considerato inattivo

source: Timer counts down instead of up
de: Timer zählt runter statt hoch
it: Il timer è un conto alla rovescia anziché un cronometro

source: Interval
de: Intervall
it: Intervallo

source: Start time in minutes
de: Startzeit in Minuten
it: Quanti minuti devono passare prima dell'interruzione

source: _Autosave
de: _Automatisches Speichern
it: Salvataggio automatico

source: Prevent losing tracked time due to improper shutdown
de: Verhindern Sie, dass erfasste Zeiten durch unsachgemäßes Beenden verloren gehen
it: Impedisce la perdita di dati in caso di una chiusura indesiderata

source: Autosave every X _minutes
de: Alle X _Minuten automatisch speichern
it: Salva automaticamente ogni X minuti

source: Inclusive total time
de: Inklusive Gesamtzeit

source: Today's total time includes the ongoing timer
de: Heutige Gesamtzeit beinhaltet den laufenden Timer

# A page title of the preferences dialog
source: Tasks
de: Aufgaben

source: Task List
de: Aufgabenliste
es: Lista de tareas
it: Lista delle attività

source: _Delete confirmation
de: _Löschen bestätigen
es: Confirmación de _borrado
it: Conferma eliminazioni

source: Limit tasks shown
de: Angezeigte Aufgaben begrenzen
es: Limitar las tareas mostradas
it: Limita attività mostrate

source: Only show X number of days in the saved tasks list
de: Nur X Tage in der Liste der gespeicherten Aufgaben anzeigen
es: Mostrar sólo un número X de días en la lista de tareas guardadas
it: Mostra solo un determinato numero di giorni nella lista delle attività

source: _Days ago
de: Vor _Tagen
es: _Días atrás
it: Giorni

source: Number of days to display in the list
de: Anzahl der Tage, die in der Liste angezeigt werden sollen
es: Número de días a mostrar en la lista
it: Il numero massimo di giorni da mostrare nella lista

source: Show daily sums
de: Tägliche Summe anzeigen
it: Mostra somme giornaliere

source: _Show seconds
de: _Sekunden anzeigen
es: _Mostrar segundos
it: Mostra secondi

source: Tasks list only. Seconds always show on timer
de: Nur in der Aufgabenliste. Sekunden werden immer im Timer angezeigt
es: Sólo lista de tareas. Los segundos siempre se muestran en el temporizador
it: Solo per la lista delle attività. I secondi sono sempre visibili nel timer.

source: Show tags
de: Tags anzeigen
it: Mostra tag

source: Tags are saved, just not shown
de: Tags werden gespeichert, aber nicht angezeigt
it: I tag saranno salvati ma non mostrati

source: Task Input
de: Aufgaben-Eingabe

source: _Autocomplete
de: _Automatisch vervollständigen

# A page title of the preferences dialog
source: Data
de: Daten

source: Reports
de: Berichte

source: Week starts on
de: Woche beginnt am

source: Monday
de: Montag

source: Sunday
de: Sonntag

source: Database
de: Datenbank

source: Database location
de: Speicherort der Datenbank
it: Posizione database

source: Browse
de: Suchen
it: Sfoglia

source: Report
de: Bericht
it: Resoconto

source: This Week
de: Diese Woche

source: Last Week
de: Letzte Woche

source: Past 7 days
de: Letzte 7 Tage

source: This month
de: Diesen Monat
it: Questo mese

source: Past 30 days
de: Letzte 30 Tage
it: Ultimi 30 giorni

source: Past 180 days
de: Letzte 180 Tage
it: Ultimi 180 giorni

source: Past year
de: Letztes Jahr
it: Ultimo anno

source: Date range
de: Datumsbereich
it: Personalizzato

source: End
de: Ende
it: Fine

source: Use the format MM/DD/YYYY
de: Nutzen Sie das Format MM/DD/YYYY
it: Usare il formato MM/GG/AAAA

source: Start date must be before end date
de: Startdatum muss vor Enddatum liegen
it: La data iniziale dev'essere prima della data iniziale

source: Sort by:
de: Sortieren nach:
it: Ordina per:

source: Task
de: Aufgabe
es: Tarea
it: Attività

source: Filter by task or tags
de: Nach Aufgaben und Tags sortieren
it: Filtra per attività o tag

source: Tasks
de: Aufgaben
it: Attività

source: Task, Task 2
de: Aufgabe, Aufgabe 2
it: Attività, Attività 2

source: Refresh
de: Aktualisieren
it: Aggiorna

source: Task Details
de: Aufgabendetails
es: Detalles de la tarea
it: Dettagli attività

source: Stop
de: Stopp
es: Detener
it: Fine

source: Total
de: Gesamt
it: Totale

source: Add Similar Task
de: Ähnliche Aufgabe hinzufügen

source: Delete all
de: Alle löschen
es: Borrar todo
it: Elimina tutto

source: Time
de: Zeit
es: Tiempo
it: Tempo

source: Add Task
de: Aufgabe hinzufügen
it: Aggiungi attività

source: Main Menu
de: Hauptmenü
es: Menú principal
it: Menu principale

source: Task Name #tags
de: Aufgabenname #Tags
it: Nome attività #Tag

source: _Generate Report
de: _Bericht erstellen
it: Resoconto

source: Back up
de: Sichern
it: Esegui backup

source: _Export as CSV
de: Als CSV _exportieren
it: Esporta come CSV

source: Import
de: Importieren
it: Importa

source: _Delete history
de: _Chronik löschen
es: _Borrar historial
it: Cancella cronologia

source: _Preferences
de: _Einstellungen
es: _Preferencias
it: Preferenze

source: _About rusttimetrack
de: _Info zu rusttimetrack
es: _Acerca de rusttimetrack
it: Informazioni

source: translator-credits
de: Gabriel Brand <gabr.brand@gmail.com>
es: Óscar Fernández Díaz <oscfdezdz@tuta.io>
it: Musiclover382 <musiclover382@protonmail.com>

source: Delete history?
de: Chronik löschen?
es: ¿Borrar historial?
it: Cancellare la cronologia?

source: Delete
de: Löschen
es: Borrar
it: Elimina

source: This will delete ALL of your task history.
de: Dadurch wird Ihre GESAMTE Aufgabenchronik gelöscht.
es: Esto borrará TODO el historial de tareas.
it: Verranno eliminate TUTTE le attività svolte.

source: Type DELETE in the box below then click Delete to proceed.
de: Geben Sie LÖSCHEN in das Feld unten ein und klicken Sie dann auf Löschen, um fortzufahren.
es: Escriba BORRAR en la casilla de abajo y haga clic en Borrar para continuar.
it: Scrivere ELIMINA nella casella sottostante, poi cliccare Elimina per continuare.

source: DELETE
de: LÖSCHEN
es: BORRAR
it: ELIMINA

source: Discard
de: Verwerfen
es: Descartar
it: Scarta

source: Continue
de: Fortsetzen
es: Continuar
it: Continua

source: Time's up!
de: Die Zeit ist um!
it: Tempo scaduto!

source: Your rusttimetrack timer ended.
de: Ihr rusttimetrack-Timer ist abgelaufen.
it: Il timer di rusttimetrack è concluso.

source: Backup Database
de: Sicherungsdatenbank
it: Backup del database

source: Save
de: Speichern
it: Salva

source: Open
de: Öffnen
it: Apri

source: Not a valid database
de: Keine gültige Datenbank
it: Database non valido

source: Duration
de: Dauer
it: Tempo

source: No Results
de: Keine Ergebnisse
it: Nessun risultato

source: All Results
de: Alle Ergebnisse
it: Tutti i risultati

source: no tags
de: Keine Tags
it: Nessun tag

source: Edit Task
de: Aufgabe bearbeiten
es: Editar tarea
it: Modifica attività

source: *Use the format YYYY-MM-DD HH:MM:SS
de: *Nutzen Sie das Format YYYY-MM-DD HH:MM:SS
it: *Usare il formato AAAA-MM-GG HH:MM:SS

source: *Use the format YYYY-MM-DD HH:MM
de: *Nutzen Sie das Format YYYY-MM-DD HH:MM
it: *Usare il formato AAAA-MM-GG HH:MM

source: *Start time cannot be later than stop time.
de: *Startzeit darf nicht nach der Endzeit liegen.
es: *La hora de inicio no puede ser posterior a la hora de finalización.
it: *Il tempo iniziale non può essere successivo al tempo finale.

source: *Time cannot be in the future.
de: *Zeit darf nicht in der Zukunft liegen.
es: *El tiempo no puede estar en el futuro.
it: *Il tempo non può essere futuro.

source: Delete task
de: Aufgabe löschen
es: Borrar tarea
it: Elimina attività

source: Delete task?
de: Aufgabe löschen?
es: ¿Borrar tarea?
it: Eliminare l'attività?

source: New Name #tags
de: Neuer Name #Tags
it: Nuovo nome #Tag

source: Task name cannot be empty.
de: Aufgabenname darf nicht leer sein.
it: Il nome dell'attività non può essere vuoto.

source: Delete All?
de: Alle löschen?
es: ¿Borrar todo?
it: Eliminare tutto?

source: This will delete all occurrences of this task on this day.
de: Dadurch werden alle Einträge dieser Aufgabe an diesem Tag gelöscht.
es: Esto borrará todas las ocurrencias de esta tarea en este día.
it: Verranno eliminate tutte le attività con questo nome in questo giorno.

source: New Task
de: Neue Aufgabe
it: Nuova attività

source: Add
de: Hinzufügen
it: Aggiungi

source: *Task name cannot be blank.
de: *Aufgabenname darf nicht leer sein.
it: *Il nome dell'attività non può essere vuoto.

source: Today
de: Heute
es: Hoy
it: Oggi

source: Yesterday
de: Gestern
es: Ayer
it: Ieri

source: Task Name
de: Aufgabenname
es: Nombre de la tarea
it: Nome attività

source: You have been idle for
de: Sie waren inaktiv für
es: Ha estado inactivo durante
it: Sei stato inattivo per

source: Would you like to discard that time, or continue the clock?
de: Möchten Sie diese Zeit verwerfen oder die Uhr fortsetzen?
es: ¿Desea descartar ese tiempo o continuar el reloj?
it: Vuoi scartare tale lasso di tempo o continuare regolarmente?

source: Autosave Restored
de: Automatische Speicherung wiederhergestellt
it: Salvataggio automatico ripristinato

source: rusttimetrack shut down improperly. An autosave was restored.
de: rusttimetrack wurde nicht ordnungsgemäß beendet. Eine automatische Speicherung wurde wiederhergestellt.
it: rusttimetrack non si è chiuso correttamente. I dati salvati automaticamente sono stati ripristinati.

source: Stop the timer to duplicate a task.
de: Stoppen Sie den Timer, um eine Aufgabe zu duplizieren.
it: Ferma il timer per duplicare un'attività.

source: Create or choose a CSV file
de: Erstellen oder wählen Sie eine CSV-Datei aus
it: Crea o scegli un file CSV

source: Accept
de: Auswählen
it: Conferma

source: Exporting as CSV failed.
de: Exportieren als CSV fehlgeschlagen.
it: Impossibile esportare come CSV.

source: Exported as CSV successfully.
de: Erfolgreich als CSV exportiert.
it: Esportazione come CSV completata.

source: CSV Export
it: Esportazione come CSV

source: Past week
it: Ultima settimana

source: Start
es: Iniciar
it: Inizio

source: Tags
it: Tag

source: tags
it: Tag

source: Time Tracker
es: Controlador de tiempo

source: timer;tracker;clock;tasks;productivity;
es: timer;tracker;clock;tasks;productivity;temporizador;controlador;reloj;tareas;productividad;

source: Track your time without being tracked.
es: Controle su tiempo sin ser controlado.

source: rusttimetrack is an elegant time tracking app built for Gnome with Rust and GTK4. In addition to tracking time spent on tasks, you can edit that time, delete entries, and change settings. It even has idle detection.
es: rusttimetrack es una elegante aplicación de control de tiempo construida para Gnome con Rust y GTK4. Además de registrar el tiempo empleado en las tareas, puede editar ese tiempo, eliminar entradas y cambiar la configuración. Incluso tiene detección de inactividad.

source: Start Tracking
es: Iniciar seguimiento

source: Type your task and press start
es: Escriba su tarea y pulse Inicio

source: Prior tasks will show up here
es: Las tareas anteriores aparecerán aquí

source: Right-click a task to duplicate it
es: Haga clic derecho en una tarea para duplicarla

source: (Gnome only)
es: (sólo Gnome)

source: *Use the format MMM DD YYYY HH:MM:SS
es: *Usar el formato MMM DD YYYY HH:MM:SS

source: *Use the format MMM DD YYYY HH:MM
es: *Usar el formato MMM DD YYYY HH:MM

source: No Task Name
es: Sin nombre de tarea

source: Enter a task name to start the timer.
es: Introduzca un nombre de tarea para iniciar el temporizador.
